# BuiltInFailures.StructuralCustomConnectionFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralCustomConnectionFailures Class
BuiltInFailures Class Members See Also
---
Failures about StructuralConnectionHandler.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class StructuralCustomConnectionFailures
```

Visual Basic
---
```text
Public NotInheritable Class StructuralCustomConnectionFailures
```

Visual C++
---
```text
public ref class StructuralCustomConnectionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..StructuralCustomConnectionFailures
# See Also
BuiltInFailures..::..StructuralCustomConnectionFailures Members
Autodesk.Revit.DB Namespace